Autodesk.Revit.DB.ModelUtils.GetSingleUserModelCurrentSessionOwner(Autodesk.Revit.DB.ModelPath)
Returns current session owner of the specified single-user model.
modelPath:
Path to the single-user model.
Returns:
Name of current session owner.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null